Repository: IQUXAe/MonoChat_matrix
Catalog: lib/l10n/arb/app_*.arb
Languages: ru

# chatsTitle
source: Chats
ru: Чаты

source: Syncing...
ru: Синхронизация...

source: New Chat
ru: Новый чат

# messagePlaceholder
source: Message
ru: Сообщение

source: Take Photo
ru: Сделать фото

source: Choose Photo
ru: Выбрать фото

source: Choose Video
ru: Выбрать видео

source: Choose File
ru: Выбрать файл

source: Cancel
ru: Отмена

source: Join Room
ru: Вступить

# youHaveBeenInvited
source: You have been invited to join {roomName}
ru: Вас пригласили в {roomName}

# typingIndicator
source: {names} is typing...
ru: {names} печатает...

# replyingTo
source: Replying to {user}
ru: Ответ {user}

source: Waiting for message...
ru: Ожидание сообщения...

# filePickerError
source: The system file picker could not be opened. This often happens on Linux distributions missing "xdg-desktop-portal" services.
ru: Не удалось открыть системный выбор файлов. Это часто случается на Linux дистрибутивах без сервиса "xdg-desktop-portal".

source: OK
ru: ОК

source: Error
ru: Ошибка

source: Save
ru: Сохранить

source: Saved
ru: Сохранено

# saveImageTitle
source: Save Image?
ru: Сохранить изображение?

# saveImageContent
source: Do you want to save this image?
ru: Вы хотите сохранить это изображение?

# imageSavedSuccess
source: Image saved successfully.
ru: Изображение успешно сохранено.

# systemDialogError
source: System dialog unavailable. Image saved to: {path}
ru: Системный диалог недоступен. Изображение сохранено в: {path}

# failedToSave
source: Failed to save: {error}
ru: Не удалось сохранить: {error}

source: Send
ru: Отправить

source: Tap to retry
ru: Нажмите, чтобы повторить

source: File
ru: Файл

source: You
ru: Вы

source: Send Photo
ru: Отпр. фото

# sendPhotos
source: Send {count} Photos
ru: Отпр. {count} фото

source: Send Video
ru: Отпр. видео

source: Send File
ru: Отпр. файл

# sendFiles
source: Send {count} Files
ru: Отпр. {count} файлов

# totalSize
source: Total size: {size}
ru: Размер: {size}

source: Calculating...
ru: Считаем...

source: Will be compressed
ru: Будет сжато

source: Compress
ru: Сжать

# compressDescription
source: Reduce file size for faster sending
ru: Уменьшить размер для быстрой отправки

source: Settings
ru: Настройки

source: Profile
ru: Профиль

source: Unknown User
ru: Неизвестный пользователь

source: Start Conversation
ru: Начать чат

source: Send Message
ru: Написать

source: Ignore User
ru: Игнорировать

# ignoreUserConfirmation
source: Are you sure you want to ignore {userName}? You will no longer see messages from this user.
ru: Вы уверены, что хотите игнорировать {userName}? Вы больше не будете видеть сообщения от этого пользователя.

source: Ignore
ru: Игнорировать

source: Close
ru: Закрыть

source: Online
ru: В сети

source: Offline
ru: Не в сети

source: Just now
ru: Только что

# lastSeenMinutesAgo
source: Last seen {minutes} min ago
ru: Был(а) {minutes} мин назад

# lastSeenHoursAgo
source: Last seen {hours}h ago
ru: Был(а) {hours}ч назад

# lastSeenAt
source: Last seen {date}
ru: Был(а) {date}

# newMessageInMonoChat
source: New message
ru: Новое сообщение

source: Open app to read messages
ru: Откройте приложение, чтобы прочитать сообщения

source: Incoming Messages
ru: Входящие сообщения

# unreadChatsInApp
source: {count} unread chats in {appName}
ru: {count} непрочитанных чатов в {appName}

source: Direct Chats
ru: Личные чаты

source: Groups
ru: Группы

source: Reply
ru: Ответить

source: Write a message...
ru: Написать сообщение...

source: Mark as read
ru: Прочитано

# noGoogleServicesWarning
source: Push notifications may not work without Google Play Services. Consider using UnifiedPush.
ru: Push-уведомления могут не работать без Google Play Services. Рассмотрите использование UnifiedPush.

# oopsPushError
source: Oops! Push notifications encountered an error.
ru: Ой! Произошла ошибка push-уведомлений.

source: Notifications
ru: Уведомления

source: Push Provider
ru: Провайдер уведомлений

source: Push Notifications Not Available
ru: Push-уведомления недоступны

source: Learn More
ru: Узнать больше

# doNotShowAgain
source: Don't show again
ru: Не показывать снова

# noUnifiedPushDistributor
source: No push notification distributor found. Install ntfy or another UnifiedPush app.
ru: Не найден провайдер push-уведомлений. Установите ntfy или другое UnifiedPush приложение.

# pushStatus
source: Status
ru: Статус

source: Connected
ru: Подключено

source: Not Connected
ru: Не подключено

# pushDistributor
source: Distributor
ru: Дистрибьютор

source: None selected
ru: Не выбран

source: Select Push Distributor
ru: Выбрать провайдер

# unregisterPush
source: Unregister Push Notifications
ru: Отключить уведомления

# unregisterPushConfirm
source: Are you sure you want to unregister from push notifications?
ru: Вы уверены, что хотите отключить push-уведомления?

source: Unregister
ru: Отключить

# pushInfoText
source: MonoChat uses UnifiedPush for notifications - a FOSS alternative to proprietary push services. Install a UnifiedPush distributor like ntfy, NextPush, or Gotify.
ru: MonoChat использует UnifiedPush для уведомлений — FOSS альтернативу проприетарным сервисам. Установите UnifiedPush дистрибьютор: ntfy, NextPush или Gotify.

# learnMoreAboutUnifiedPush
source: Learn more about UnifiedPush â†’
ru: Узнать больше о UnifiedPush →

source: Notification Rules
ru: Правила уведомлений

# importantNotifications
source: Important
ru: Важные

# advancedNotifications
source: Advanced
ru: Дополнительные

source: Mute All Notifications
ru: Отключить все уведомления

# allNotificationsMuted
source: All notifications are muted
ru: Все уведомления отключены

# notificationsEnabled
source: Notifications are enabled
ru: Уведомления включены

# pushRuleMaster
source: Master Switch
ru: Главный переключатель

# pushRuleMasterDesc
source: Mute all notifications globally
ru: Отключить все уведомления глобально

# pushRuleSuppressNotices
source: Suppress Bot Messages
ru: Скрыть сообщения ботов

# pushRuleSuppressNoticesDesc
source: Don't notify for bot/system messages
ru: Не уведомлять о системных сообщениях

# pushRuleInviteForMe
source: Room Invitations
ru: Приглашения в комнаты

# pushRuleInviteForMeDesc
source: Notify when invited to rooms
ru: Уведомлять о приглашениях

# pushRuleMemberEvent
source: Membership Changes
ru: Изменения участников

# pushRuleMemberEventDesc
source: Notify about joins, leaves, kicks
ru: Уведомлять о входах, выходах, киках

# pushRuleUserMention
source: User Mentions (@you)
ru: Упоминания (@вы)

# pushRuleUserMentionDesc
source: Notify when someone mentions you
ru: Уведомлять, когда вас упоминают

# pushRuleContainsDisplayName
source: Contains Display Name
ru: Содержит имя

# pushRuleContainsDisplayNameDesc
source: Notify when your name is mentioned
ru: Уведомлять, когда упоминают ваше имя

# pushRuleRoomMention
source: Room Mentions (@room)
ru: Упоминания комнаты (@room)

# pushRuleRoomMentionDesc
source: Notify when @room is used
ru: Уведомлять при использовании @room

# pushRuleRoomNotif
source: Room Notifications
ru: Уведомления комнаты

# pushRuleRoomNotifDesc
source: Room-level notification keywords
ru: Ключевые слова на уровне комнаты

# pushRuleTombstone
source: Room Upgrades
ru: Обновления комнат

# pushRuleTombstoneDesc
source: Notify about room version upgrades
ru: Уведомлять об обновлениях версии комнаты

# pushRuleReaction
source: Reactions
ru: Реакции

# pushRuleReactionDesc
source: Notify when someone reacts to messages
ru: Уведомлять о реакциях на сообщения

# pushRuleSuppressEdits
source: Suppress Edits
ru: Скрыть редактирования

# pushRuleSuppressEditsDesc
source: Don't notify for message edits
ru: Не уведомлять о редактировании сообщений

# pushRuleCall
source: Calls
ru: Звонки

# pushRuleCallDesc
source: Notify about incoming calls
ru: Уведомлять о входящих звонках

# pushRuleEncryptedDM
source: Encrypted Direct Messages
ru: Зашифрованные ЛС

# pushRuleEncryptedDMDesc
source: Notify for encrypted one-to-one chats
ru: Уведомлять о зашифрованных личных чатах

# pushRuleDM
source: Direct Messages
ru: Личные сообщения

# pushRuleDMDesc
source: Notify for one-to-one chats
ru: Уведомлять о личных чатах

# pushRuleGroupMessage
source: Group Messages
ru: Сообщения групп

# pushRuleGroupMessageDesc
source: Notify for messages in group chats
ru: Уведомлять о сообщениях в группах

# pushRuleEncryptedGroup
source: Encrypted Groups
ru: Зашифрованные группы

# pushRuleEncryptedGroupDesc
source: Notify for encrypted group chats
ru: Уведомлять о зашифрованных групповых чатах

# pushRuleContainsUserName
source: Contains Username
ru: Содержит имя пользователя

# pushRuleContainsUserNameDesc
source: Notify when your username is mentioned
ru: Уведомлять при упоминании username

# pushRuleCustom
source: Custom notification rule
ru: Пользовательское правило

# pushRuleCategoryOverride
source: Priority Rules
ru: Приоритетные правила

# pushRuleCategoryContent
source: Content Rules
ru: Правила контента

# pushRuleCategoryRoom
source: Room Rules
ru: Правила комнат

# pushRuleCategorySender
source: Sender Rules
ru: Правила отправителей

# pushRuleCategoryUnderride
source: Default Rules
ru: Стандартные правила

source: Registered Devices
ru: Зарегистрированные устройства

# noRegisteredDevices
source: No devices registered for push notifications
ru: Нет устройств с push-уведомлениями

# removePusher
source: Remove Device
ru: Удалить устройство

# removePusherConfirm
source: This device will no longer receive push notifications. Continue?
ru: Это устройство больше не будет получать push-уведомления. Продолжить?

source: Remove
ru: Удалить

source: Troubleshooting
ru: Устранение неполадок

source: Send Test Notification
ru: Отправить тестовое уведомление

source: Test notification sent!
ru: Тестовое уведомление отправлено!

source: Copy Push Endpoint
ru: Скопировать endpoint

source: Endpoint Copied
ru: Endpoint скопирован

source: No Endpoint
ru: Нет endpoint

# noEndpointMessage
source: Push notifications are not configured yet.
ru: Push-уведомления ещё не настроены.

source: Refresh Push Status
ru: Обновить статус

source: Spaces
ru: Пространства

source: All Chats
ru: Все чаты

source: Add
ru: Добавить

source: Create
ru: Создать

source: Create Space
ru: Создать пространство

source: Create Subspace
ru: Создать подпространство

source: Create Group
ru: Создать группу

source: Space Name
ru: Название пространства

source: Group Name
ru: Название группы

source: Topic (optional)
ru: Тема (необязательно)

# spaceAlias
source: Space Alias (e.g. my-space)
ru: Псевдоним (например, my-space)

source: Public Space
ru: Публичное пространство

source: Private Space
ru: Приватное пространство

source: Anyone can join
ru: Любой может присоединиться

source: Invite only
ru: Только по приглашению

# spaceDescription
source: Spaces help you organize your rooms and communities. Create subspaces and add rooms to build your community structure.
ru: Пространства помогают организовать ваши комнаты и сообщества. Создавайте подпространства и добавляйте комнаты для построения структуры сообщества.

source: Failed to create space
ru: Не удалось создать пространство

source: Space not found
ru: Пространство не найдено

# emptySpace
source: This space is empty
ru: Это пространство пусто

source: Add to Space
ru: Добавить в пространство

source: Remove from Space
ru: Удалить из пространства

# moveToSpace
source: Move to Different Space
ru: Переместить в другое пространство

# leaveSpaceConfirmation
source: Are you sure you want to leave this space?
ru: Вы уверены, что хотите покинуть это пространство?

source: Leave
ru: Покинуть

source: Invite
ru: Пригласить

source: members
ru: участников

source: Search
ru: Поиск

source: Load More
ru: Загрузить ещё

source: Unread
ru: Непрочитанные

source: Direct Messages
ru: Личные сообщения

source: No chats yet
ru: Пока нет чатов

source: Start a chat
ru: Начать чат

source: New Group
ru: Новая группа

source: New Space
ru: Новое пространство

source: Public Group
ru: Публичная группа

source: Private Group
ru: Приватная группа

source: Enable Encryption
ru: Включить шифрование

source: End-to-end encryption
ru: Сквозное шифрование

source: Invite Members
ru: Пригласить участников

source: Search users
ru: Поиск пользователей

source: No users found
ru: Пользователи не найдены

source: Add Members
ru: Добавить участников

# selectedMembers
source: {count} selected
ru: {count} выбрано

# groupCreated
source: Group created successfully
ru: Группа успешно создана

# createGroupDescription
source: Create a new group for discussions
ru: Создать новую группу для общения

# spaceCreated
source: Space created successfully
ru: Пространство успешно создано

source: Filter chats
ru: Фильтр чатов

source: Pinned
ru: Закреплённые

source: Favorites
ru: Избранное

source: Muted
ru: Без звука

source: Searchable
ru: Поиск

# searchableDescription
source: Allow users to find this group in public search
ru: Группу можно найти в публичном поиске

source: Join by Tag
ru: Присоединиться по тегу

# enterTag
source: Enter room tag (e.g. #room:server.com)
ru: Введите тег комнаты (напр. #room:server.com)

# invalidTag
source: Invalid room tag or ID
ru: Неверный тег или ID комнаты

source: Join
ru: Присоединиться

# notificationsSettings
source: Notification Settings
ru: Настройки уведомлений

source: Mute Notifications
ru: Отключить уведомления

source: Unmute Notifications
ru: Включить уведомления

source: Notifications muted
ru: Уведомления отключены

source: Notifications on
ru: Уведомления включены

source: Mentions only
ru: Только упоминания

source: All messages
ru: Все сообщения

# roomNotificationSuccess
source: Notification settings updated
ru: Настройки уведомлений обновлены

# roomNotificationError
source: Failed to update notification settings
ru: Не удалось обновить настройки уведомлений
